Revit 2026 API

# ExternalCommandData Class

---

A class contains reference to Application and View which are needed by external command.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.UIExternalCommandData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalCommandData : APIObject
```
```vb
Public Class ExternalCommandData
	Inherits APIObject
```
```cpp
public ref class ExternalCommandData : public APIObject
```
```fsharp
type ExternalCommandData =
    class
        inherit APIObject
    end
```

The ExternalCommandData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Application | Retrieves an object that represents the current Application for external command. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | JournalData | A data map that can be used to read and write data to the Autodesk Revit journal file. |
|  | View | Retrieves an object that represents the View external command work on. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI Namespace